# Data Reading and Writing

# First import necessary libraries i.e Numpys and Pandas

In [1]:
import numpy as np
import pandas as pd

# Import Data.txt using read_table feature from python pandas and assign it to the variable df
Download Data Set from the provide google drive

In [5]:
df = pd.read_table("Data/data.txt")
df

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

# Import second data2.txt using read_table feature from python pandas and assign it to the variable df2

In [7]:
df2 = pd.read_table("Data/data2.txt")
df2

    Tom,80,M
0   Tim,85,M
1   Kim,70,M
2  Kate,90,F
3  Alex,75,F

# Read a text file named "data2.txt" using the pandas library in Python. And sepeart the values after comma

In [8]:
df2 = pd.read_table("Data/data2.txt", sep=",")
df2

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

# Follow the code above and assign it to the df variable

In [10]:
df = df2
df
# df= pd.read_table("Data/data2.txt", sep=",")
# df

    Tom  80  M
0   Tim  85  M
1   Kim  70  M
2  Kate  90  F
3  Alex  75  F

# Read a text file named "data2.txt" using the pandas library in Python. Seperate values by commas, and dont show the column names

In [11]:
df = pd.read_table("Data/data2.txt",
                  sep=",",
                  header=None)
df

      0   1  2
0   Tom  80  M
1   Tim  85  M
2   Kim  70  M
3  Kate  90  F
4  Alex  75  F

# Read a text file named "data2.txt" using the pandas library in Python. Seperate the values by commas, and assign column names where names = ["name", 'score', "sex"]

In [12]:
df = pd.read_table("Data/data2.txt",
                  sep=",",
                  header=None,
                  names = ["name", "score", "sex"])
df

   name  score sex
0   Tom     80   M
1   Tim     85   M
2   Kim     70   M
3  Kate     90   F
4  Alex     75   F

# Taking reference to the above code, set the "name" column as index of the DataFrame

In [13]:
df = pd.read_table("Data/data2.txt",
                  sep=",",
                  header=None,
                  names = ["name", "score", "sex"],
                  index_col ="name" )
df

      score sex
name
Tom      80   M
Tim      85   M
Kim      70   M
Kate     90   F
Alex     75   F

# Read a text file named "data3.txt" using the pandas library in Python and seperate the values by commas and assign it to df2 variable

In [14]:
df2 = pd.read_table("Data/data3.txt" , sep=",")
df2

  lesson  name  one  two
0   Math   Kim   80   85
1   Math   Tim   90   70
2   Math   Tom   70   95
3   Stat  Kate   65   90
4   Stat  Alex   85   80
5   Stat   Sam   55   70

# Taking Reference from the above code, add an additional parameter index_col=["lesson", "name"] which sets the columns "lesson" and "name" as the multi-levl index of the dataframe

In [15]:
df2 = pd.read_table("Data/data3.txt" , sep=",",
                   index_col = ["lesson", "name"])
df2

             one  two
lesson name
Math   Kim    80   85
       Tim    90   70
       Tom    70   95
Stat   Kate   65   90
       Alex   85   80
       Sam    55   70

# Reads a text file named "data4.txt" using the pandas library in Python. Seperate the values by commas, and assign it to variable df3

In [17]:
df3 = pd.read_table("Data/data4.txt" , sep=",")
df3

                          #hello
name                score    sex
#scores of students NaN      NaN
Tim                 80         M
Kate                85         F
Alex                70         M
Tom                 90         M
Kim                 75         F

# Taking reference from the above code, skip the first and third rows of the file during the loading process.

In [18]:
df3 = pd.read_table("Data/data4.txt" , sep=",",
                   skiprows= (0,2))
df3

   name  score sex
0   Tim     80   M
1  Kate     85   F
2  Alex     70   M
3   Tom     90   M
4   Kim     75   F

# Taking reference from the above code, skip the first and third rows of the file during the loading process and only select the first two columns

In [19]:
df3 = pd.read_table("Data/data4.txt" , sep=",",
                   skiprows= (0,2),
                   usecols= (0,1))
df3

   name  score
0   Tim     80
1  Kate     85
2  Alex     70
3   Tom     90
4   Kim     75

# Taking reference from the above code, skip the first and third rows of the file during the loading process and only select the first two columns also add and additional parameter which limit sthe number of rows to be read to 3

In [ ]:
df3 = pd.read_table("Data/data4.txt" , sep=",",
                   skiprows= (0,2),
                   usecols= (0,1),
                   nrows= 3)
df3

# Read a file named "data.txt" using the pandas library in Python. Seperate the values by commas, and try to export that data.txt into new_data.csv format and save it to your machine

In [21]:
df4= pd.read_table("Data/data.txt", sep="\t")
df4

  name  score sex
0  Tim     80   M
1  Tom     85   M
2  Kim     70   F
3  Sam     90   M
4  Efe     75   M

In [22]:
df4.to_csv("Data/new_data.csv")

In [24]:
changed_data = pd.read_csv("Data/new_data.csv")
changed_data

   Unnamed: 0 name  score sex
0           0  Tim     80   M
1           1  Tom     85   M
2           2  Kim     70   F
3           3  Sam     90   M
4           4  Efe     75   M